IDENTIFICATION DIVISION.
PROGRAM-ID. GETA.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-A      PIC 9.

   LINKAGE SECTION.
   01 LS-ANS1   PIC 9(4).
   01 LS-ANS2   PIC 9(4).
   01 LS-RESULT PIC 9.

PROCEDURE DIVISION USING LS-ANS1, LS-ANS2, LS-RESULT.
   MOVE 0 TO LS-RESULT
   PERFORM VARYING WS-A FROM 1 BY 1 UNTIL WS-A > 4
       IF LS-ANS1(WS-A:1) IS EQUAL TO LS-ANS2(WS-A:1) THEN
           ADD 1 TO LS-RESULT
       END-IF    
   END-PERFORM.
EXIT PROGRAM.